blog/2010/01/02/solarphp-in-sql-basics/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>solarphp中SQL基础 - Gu Weigang</title>
  <meta charset="utf-8" />
  <meta name="author" content="Gu Weigang" />
  <meta name="description" content="" />
  <meta name="keywords" content="" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">

  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
</head>

  <body class="container">
<header id="header">
  <h1 class="title"><a href="/">Gu Weigang</a></h1>
  <ul>
    <li><a href="/blog/">Blog</a></li>
    <li><a href="/tags/">Tags</a></li>
    <li><a href="/about/">About</a></li>
  </ul>
  <form method="get" id="search" action="https://duckduckgo.com">
    <input type="text" class="field" name="q" id="s" placeholder="Search">
    <input type="hidden" name="as_sitesearch" value="guweigang.com">
  </form>
</header>

<section id="content" role="main">
  <h1>solarphp中SQL基础</h1>
  <p>
主要涉及到Solar\_Sql包
<a href="http://godpress.cn/?p=243">上篇文章中我们有提到solar初始化时会自动注册Solar\_Sql类</a>，所以我们只需要使用Solar\_Registry，就可以实例化Solar\_Sql类。
</p>


<pre class="example">
$sql = Solar_Registry::get('sql');
</pre>


<p>
Solar\_Sql是基于PDO的，能够适用MySQL, PostgreSQL, SQLite，而对于使用者来讲只需要使用Sloar\_Sql的功能，不用关心各种不同数据库的细节。
配置Sloar\_Sql对象
</p>


<pre class="example">
    $config['Solar_Sql']['adapter'] = 'Solar_Sql_Adapter_Mysql';
$config['Solar_Sql_Adapter_Mysql'] = array(
    'host' =&gt; 'localhost',
    'user' =&gt; 'root',
    'pass' =&gt; '123456',
    'name' =&gt; 'solar',
);
</pre>


<p>
那么你就可以像这样使用它了：
</p>


<pre class="example">
    $rs = $sql-&gt;query("select * from message");
$this-&gt;arr = $rs-&gt;fetchAll();
</pre>


<p>
查旬的结果是<a href="http://godpress.cn/?p=250">pdoStatement格式</a>，获取数据可以用下面这些方式：
</p>


<pre class="example">
    Solar_Sql_Adapter::fetchAll() //returns a sequential array of all rows. The rows themselves are associative arrays (keys are the column names).
Solar_Sql_Adapter::fetchAssoc() //returns an associative array of all rows (key is the first column).
Solar_Sql_Adapter::fetchCol() //returns a sequential array of all values in the first column.
Solar_Sql_Adapter::fetchOne() //returns the first row as an associative array (keys are the column names).
Solar_Sql_Adapter::fetchPairs() //returns an associative array where each key is the first column and each value is the second column.
Solar_Sql_Adapter::fetchValue() //returns the value of the first row in the first column.
</pre>


<p>
To quote values so they can be used safely in SQL commands, use ...
</p>


<ul class="org-ul">
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/quote%28%29">Solar\_Sql\_Adapter::quote()</a>
</li>
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/quoteInto%28%29">Solar\_Sql\_Adapter::quoteInto()</a>
</li>
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/quoteMulti%28%29">Solar\_Sql\_Adapter::quoteMulti()</a>
</li>
</ul>


<p>
For direct-execution of commands, use...
</p>


<ul class="org-ul">
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/query%28%29">Solar\_Sql\_Adapter::query()</a>
</li>
</ul>


<p>
To fetch results, use ...
</p>


<ul class="org-ul">
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/fetchAll%28%29">Solar\_Sql\_Adapter::fetchAll()</a>
</li>
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/fetchAssoc%28%29">Solar\_Sql\_Adapter::fetchAssoc()</a>
</li>
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/fetchCol%28%29">Solar\_Sql\_Adapter::fetchCol()</a>
</li>
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/fetchOne%28%29">Solar\_Sql\_Adapter::fetchOne()</a>
</li>
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/fetchPairs%28%29">Solar\_Sql\_Adapter::fetchPairs()</a>
</li>
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/fetchPdo%28%29">Solar\_Sql\_Adapter::fetchPdo()</a>
</li>
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/fetchSql%28%29">Solar\_Sql\_Adapter::fetchSql()</a>
</li>
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/fetchValue%28%29">Solar\_Sql\_Adapter::fetchValue()</a>
</li>
</ul>


<p>
To conveniently manipulate data in individual tables, use...
</p>


<ul class="org-ul">
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/insert%28%29">Solar\_Sql\_Adapter::insert()</a>
</li>
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/update%28%29">Solar\_Sql\_Adapter::update()</a>
</li>
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/delete%28%29">Solar\_Sql\_Adapter::delete()</a>
</li>
</ul>


<p>
For auto-increment values and database-portable sequences, use...
</p>


<ul class="org-ul">
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/lastInsertId%28%29">Solar\_Sql\_Adapter::lastInsertId()</a>
</li>
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/createSequence%28%29">Solar\_Sql\_Adapter::createSequence()</a>
</li>
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/dropSequence%28%29">Solar\_Sql\_Adapter::dropSequence()</a>
</li>
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/nextSequence%28%29">Solar\_Sql\_Adapter::nextSequence()</a>
</li>
</ul>


<p>
For database-portable transactions, use...
</p>


<ul class="org-ul">
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/begin%28%29">Solar\_Sql\_Adapter::begin()</a>
</li>
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/commit%28%29">Solar\_Sql\_Adapter::commit()</a>
</li>
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/rollback%28%29">Solar\_Sql\_Adapter::rollback()</a>
</li>
</ul>


<p>
For database-portable table/column/index modification, use...
</p>


<ul class="org-ul">
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/createTable%28%29">Solar\_Sql\_Adapter::createTable()</a>
</li>
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/dropTable%28%29">Solar\_Sql\_Adapter::dropTable()</a>
</li>
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/addColumn%28%29">Solar\_Sql\_Adapter::addColumn()</a>
</li>
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/dropColumn%28%29">Solar\_Sql\_Adapter::dropColumn()</a>
</li>
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/createIndex%28%29">Solar\_Sql\_Adapter::createIndex()</a>
</li>
<li><a href="http://solarphp.com/class/Solar_Sql_Adapter/dropIndex%28%29">Solar\_Sql\_Adapter::dropIndex()</a>
</li>
</ul>

</section>



<footer id="footer">
    Send comments, critique and suggestions to <a href="mailto:guweigang &lt;at&gt; outlook &lt;dot&gt; com">Gu Weigang</a>.
    Powered by <a href="https://github.com/kelvinh/org-page">org-page</a>
</footer>

  </body>
</html>
